euler-477.org
#+TITLE: Euler Problem 477
#+OPTIONS: num:nil
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="org-overrides.css" />

* Introduction

I'm assuming some familiarity with [[https://projecteuler.net][Project Euler]].  Basically, a bunch of
typically numerically intensive puzzles that can be solved using a
computer.

At any rate, way back when, [[https://projecteuler.net/problem=477][477]] was the newest one when I was looking.
They have, clearly, progressed since then.  That said, I've had this
problem in my mind for quite a long time now.  I kept hoping to find some
clever data structure to solve it, but never found one.

This page is really just moving some notes I had on it.  I found an old
paper notebook that had the final thoughts before I abandoned this, and
thought I would jot them in electronic form.  This also required me to
reimplement some of the ideas, as I long lost whatever computer files I had
with these notes.

* Easy top down solution (that of course doesn't work)

This is a pretty straight forward implementation.  I wasn't going for
anything particularly smart, but was curious just how long it would take.

#+begin_src lisp
  (defun solve (sequence &optional (num-players 2) (cur-player 0) (i 0) (j (1- (length sequence))))
    (cond ((= i j)
           (list 0 (elt sequence i)))

          (t
           (let* ((left-number            (elt sequence i))
                  (right-number           (elt sequence j))
                  (next-player            (mod (1+ cur-player) num-players))
                  (left-opponent-choices  (solve sequence num-players next-player (1+ i) j))
                  (right-opponent-choices (solve sequence num-players next-player i (1- j))))
             (if (> (incf (elt left-opponent-choices cur-player) left-number)
                    (incf (elt right-opponent-choices cur-player) right-number))
                 left-opponent-choices
                 right-opponent-choices)))))
#+end_src

#+RESULTS:
: SOLVE


Does it give the right answers?  Before I can fully answer this, I need the
sequence generator for the larger games.  So, lets get that real quick.

#+begin_src lisp :exports code
  (defun gen-sequence (n)
    (let ((sequence (make-array n :initial-element 0)))
      (loop repeat (1- n)
            for i from 1
            do (setf (elt sequence i) (mod (+ (expt (elt sequence (1- i)) 2) 45) 1000000007)))
      sequence))
#+end_src

#+RESULTS:
: GEN-SEQUENCE

Does that agree with page on how the sequence starts?

#+begin_src lisp :exports both
  (gen-sequence 7)
#+end_src

#+RESULTS:
| 0 | 45 | 2070 | 4284945 | 753524550 | 478107844 | 894218625 |


And do we get the right answers for the smaller values?

#+begin_src lisp :exports both
  (mapcar (lambda (s) (solve s)) (list #(1 2 10 3)
                                       (gen-sequence 2)
                                       (gen-sequence 4)
                                       (gen-sequence 10)))

#+end_src

#+RESULTS:
|         11 |          5 |
|         45 |          0 |
|    4284990 |       2070 |
| 1966275296 | 1292053722 |


We get answers, but we run too slow to see if we can get the 100 and larger
cases.

