euler-477.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-31 Tue 05:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Euler Problem 477</title>
<meta name="author" content="Josh Berry" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-overrides.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Euler Problem 477</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org25675dd">Introduction</a></li>
<li><a href="#orgb5e87d7">Easy top down solution (that of course doesn't work)</a></li>
<li><a href="#org723f8b5">Brute caching of results</a></li>
<li><a href="#org2cc3f74">Restrict the size of the cache?</a></li>
<li><a href="#org4b932d0">Not going to wait for that to complete.</a></li>
<li><a href="#orgb2f57cf">Could I just be more efficient per layer?</a></li>
<li><a href="#org36a3dd8">Could I go parallel?</a></li>
<li><a href="#org5a64695">Could I get even more efficient per layer?</a></li>
<li><a href="#org54339db">Any obvious non \(N^2\) algorithms for this?</a></li>
<li><a href="#org7426634">How about linear?</a></li>
</ul>
</div>
</div>

<div id="outline-container-org25675dd" class="outline-2">
<h2 id="org25675dd">Introduction</h2>
<div class="outline-text-2" id="text-org25675dd">
<p>
I'm assuming some familiarity with <a href="https://projecteuler.net">Project Euler</a>.  Basically, a bunch of
typically numerically intensive puzzles that can be solved using a
computer.
</p>

<p>
At any rate, way back when, <a href="https://projecteuler.net/problem=477">477</a> was the newest one when I was looking.
They have, clearly, progressed since then.  That said, I've had this
problem in my mind for quite a long time now.  I kept hoping to find some
clever data structure to solve it, but never found one.
</p>

<p>
This page is really just moving some notes I had on it.  I found an old
paper notebook that had the final thoughts before I abandoned this, and
thought I would jot them in electronic form.  This also required me to
reimplement some of the ideas, as I long lost whatever computer files I had
with these notes.
</p>
</div>
</div>

<div id="outline-container-orgb5e87d7" class="outline-2">
<h2 id="orgb5e87d7">Easy top down solution (that of course doesn't work)</h2>
<div class="outline-text-2" id="text-orgb5e87d7">
<p>
This is a pretty straight forward implementation.  I wasn't going for
anything particularly smart, but was curious just how long it would take.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">solve</span> (sequence <span style="color: #6ae4b9;">&amp;optional</span> (num-players 2) (cur-player 0) (i 0) (j (1- (length sequence))))
  (<span style="color: #b6a0ff;">cond</span> ((= i j)
         (list 0 (elt sequence i)))

        (t
         (<span style="color: #b6a0ff;">let*</span> ((left-number            (elt sequence i))
                (right-number           (elt sequence j))
                (next-player            (mod (1+ cur-player) num-players))
                (left-opponent-choices  (solve sequence num-players next-player (1+ i) j))
                (right-opponent-choices (solve sequence num-players next-player i (1- j))))
           (<span style="color: #b6a0ff;">if</span> (&gt; (incf (elt left-opponent-choices cur-player) left-number)
                  (incf (elt right-opponent-choices cur-player) right-number))
               left-opponent-choices
               right-opponent-choices)))))
</pre>
</div>


<p>
Does it give the right answers?  Before I can fully answer this, I need the
sequence generator for the larger games.  So, lets get that real quick.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">gen-sequence</span> (n)
  (<span style="color: #b6a0ff;">let</span> ((sequence (make-array n <span style="color: #f78fe7;">:initial-element</span> 0)))
    (<span style="color: #b6a0ff;">loop</span> repeat (1- n)
          for i from 1
          do (setf (elt sequence i) (mod (+ (expt (elt sequence (1- i)) 2) 45) 1000000007)))
    sequence))
</pre>
</div>

<p>
Does that agree with page on how the sequence starts?
</p>

<div class="org-src-container">
<pre class="src src-lisp">(gen-sequence 7)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">45</td>
<td class="org-right">2070</td>
<td class="org-right">4284945</td>
<td class="org-right">753524550</td>
<td class="org-right">478107844</td>
<td class="org-right">894218625</td>
</tr>
</tbody>
</table>


<p>
And do we get the right answers for the smaller values?
</p>

<div class="org-src-container">
<pre class="src src-lisp">(mapcar (<span style="color: #b6a0ff;">lambda</span> (s) (solve s)) (list #(1 2 10 3)
                                     (gen-sequence 2)
                                     (gen-sequence 4)
                                     (gen-sequence 10)))

</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">11</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-right">45</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">4284990</td>
<td class="org-right">2070</td>
</tr>

<tr>
<td class="org-right">1966275296</td>
<td class="org-right">1292053722</td>
</tr>
</tbody>
</table>


<p>
We get answers, but we run too slow to see if we can get the 100 and larger
cases.
</p>
</div>
</div>
