euler-477.org
* Brute caching of results

What would it take to get a rough shot at the larger values?  How does a
simple cache work out?

#+begin_src lisp :exports code
  (defun solve-with-cache (sequence &optional (num-players 2) (cur-player 0) (i 0) (j (1- (length sequence))) (cache (make-hash-table)))
    (cond
      ;; We have a cached value
      ((gethash (+ (* i (length sequence)) j) cache))

      ;; This is a forced move and not worth caching...
      ((= i j)
       (list 0 (elt sequence i)))

      ;; We need to examine left/right options
      (t
       (let* ((left-number            (elt sequence i))
              (right-number           (elt sequence j))
              (next-player            (mod (1+ cur-player) num-players))
              (left-opponent-choices  (copy-seq (solve-with-cache sequence num-players next-player (1+ i) j cache)))
              (right-opponent-choices (copy-seq (solve-with-cache sequence num-players next-player i (1- j) cache))))
         (setf (gethash (+ (* i (length sequence)) j) cache)
               (if (> (incf (elt left-opponent-choices cur-player) left-number)
                      (incf (elt right-opponent-choices cur-player) right-number))
                   left-opponent-choices
                   right-opponent-choices))))))
#+end_src

#+RESULTS:
: SOLVE-WITH-CACHE

As expected, this gives us fairly quick answers for the next size up in the
examples.  (Where, fairly quick is near instant.)

#+begin_src lisp :exports both
  (mapcar (lambda (s) (solve-with-cache s)) (list #(1 2 10 3)
                                                  (gen-sequence 2)
                                                  (gen-sequence 4)
                                                  (gen-sequence 10)
                                                  (gen-sequence 100)))
#+end_src

#+RESULTS:
|          11 |           5 |
|          45 |           0 |
|     4284990 |        2070 |
|  1966275296 |  1292053722 |
| 26365463243 | 24078282389 |


Not too shockingly, it falls on its face for the next round, though.

#+begin_src lisp :results verbatim output :exports both
    (let ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
      (time
       (format t "We did get an answer, at least: ~a~&"
               (solve-with-cache (gen-sequence (expt 10 4))))))
#+end_src

#+RESULTS:
: We did get an answer, at least: (2495838522951 2465448746904)
: Evaluation took:
:   13.084 seconds of real time
:   13.084478 seconds of total run time (11.185026 user, 1.899452 system)
:   [ Run times consist of 3.749 seconds GC time, and 9.336 seconds non-GC time. ]
:   100.00% CPU
:   49,624,216,720 processor cycles
:   8,267,083,984 bytes consed
:

Where, "falls on its face" is that it takes too long and uses way too much
memory.  Which is unfortunate.  (It is fortunate, at least, that the answer
looks correct. :D)

