euler-477.html

<div id="outline-container-org723f8b5" class="outline-2">
<h2 id="org723f8b5">Brute caching of results</h2>
<div class="outline-text-2" id="text-org723f8b5">
<p>
What would it take to get a rough shot at the larger values?  How does a
simple cache work out?
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">solve-with-cache</span> (sequence <span style="color: #6ae4b9;">&amp;optional</span> (num-players 2) (cur-player 0) (i 0) (j (1- (length sequence))) (cache (make-hash-table)))
  (<span style="color: #b6a0ff;">cond</span>
    <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">We have a cached value</span>
    ((gethash (+ (* i (length sequence)) j) cache))

    <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">This is a forced move and not worth caching...</span>
    ((= i j)
     (list 0 (elt sequence i)))

    <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">We need to examine left/right options</span>
    (t
     (<span style="color: #b6a0ff;">let*</span> ((left-number            (elt sequence i))
            (right-number           (elt sequence j))
            (next-player            (mod (1+ cur-player) num-players))
            (left-opponent-choices  (copy-seq (solve-with-cache sequence num-players next-player (1+ i) j cache)))
            (right-opponent-choices (copy-seq (solve-with-cache sequence num-players next-player i (1- j) cache))))
       (setf (gethash (+ (* i (length sequence)) j) cache)
             (<span style="color: #b6a0ff;">if</span> (&gt; (incf (elt left-opponent-choices cur-player) left-number)
                    (incf (elt right-opponent-choices cur-player) right-number))
                 left-opponent-choices
                 right-opponent-choices))))))
</pre>
</div>

<p>
As expected, this gives us fairly quick answers for the next size up in the
examples.  (Where, fairly quick is near instant.)
</p>

<div class="org-src-container">
<pre class="src src-lisp">(mapcar (<span style="color: #b6a0ff;">lambda</span> (s) (solve-with-cache s)) (list #(1 2 10 3)
                                                (gen-sequence 2)
                                                (gen-sequence 4)
                                                (gen-sequence 10)
                                                (gen-sequence 100)))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">11</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-right">45</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">4284990</td>
<td class="org-right">2070</td>
</tr>

<tr>
<td class="org-right">1966275296</td>
<td class="org-right">1292053722</td>
</tr>

<tr>
<td class="org-right">26365463243</td>
<td class="org-right">24078282389</td>
</tr>
</tbody>
</table>


<p>
Not too shockingly, it falls on its face for the next round, though.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #b6a0ff;">let</span> ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
  (time
   (format t <span style="color: #79a8ff;">"We did get an answer, at least: ~a~&amp;"</span>
           (solve-with-cache (gen-sequence (expt 10 4))))))
</pre>
</div>

<pre class="example">
We did get an answer, at least: (2495838522951 2465448746904)
Evaluation took:
  13.084 seconds of real time
  13.084478 seconds of total run time (11.185026 user, 1.899452 system)
  [ Run times consist of 3.749 seconds GC time, and 9.336 seconds non-GC time. ]
  100.00% CPU
  49,624,216,720 processor cycles
  8,267,083,984 bytes consed

</pre>


<p>
Where, "falls on its face" is that it takes too long and uses way too much
memory.  Which is unfortunate.  (It is fortunate, at least, that the answer
looks correct. :D)
</p>
</div>
</div>
