euler-477.org
* Restrict the size of the cache?

This is somewhat silly, as the cache should be able to just keep a "layer"
of the solution in memory at any given time.  I could constrict it so that
it only has the last $N$ values looked at in the cache.  That will help
with memory, but will not have much help for speed, I don't think.  Lets
find out.

Biggest callout here, is if we want to limit ourselves to $N$ entries in the
cache, we have to change the order that we traverse the possibles.  In
particular, it is easy to see that we just go up and down a single "side"
of the search space here, and we wind up with a cache that is effectively
the entire search tree.

#+begin_src lisp :results verbatim output :exports both
  (trace solve-with-cache)
  (let ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
    (solve-with-cache (gen-sequence 4)))
  (untrace solve-with-cache)
#+end_src

#+RESULTS:
#+begin_example
  0: (SOLVE-WITH-CACHE #(0 45 2070 4284945))
    1: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 1 3 #<HASH-TABLE :TEST EQL :COUNT 0 {1015BC57B3}>)
      2: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 0 2 3 #<HASH-TABLE :TEST EQL :COUNT 0 {1015BC57B3}>)
        3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 3 3 #<HASH-TABLE :TEST EQL :COUNT 0 {1015BC57B3}>)
        3: SOLVE-WITH-CACHE returned (0 4284945)
        3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 2 2 #<HASH-TABLE :TEST EQL :COUNT 0 {1015BC57B3}>)
        3: SOLVE-WITH-CACHE returned (0 2070)
      2: SOLVE-WITH-CACHE returned (4284945 2070)
      2: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 0 1 2 #<HASH-TABLE :TEST EQL :COUNT 1 {1015BC57B3}>)
        3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 2 2 #<HASH-TABLE :TEST EQL :COUNT 1 {1015BC57B3}>)
        3: SOLVE-WITH-CACHE returned (0 2070)
        3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 1 1 #<HASH-TABLE :TEST EQL :COUNT 1 {1015BC57B3}>)
        3: SOLVE-WITH-CACHE returned (0 45)
      2: SOLVE-WITH-CACHE returned (2070 45)
    1: SOLVE-WITH-CACHE returned (2070 4284990)
    1: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 0 2 #<HASH-TABLE :TEST EQL :COUNT 3 {1015BC57B3}>)
      2: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 0 1 2 #<HASH-TABLE :TEST EQL :COUNT 3 {1015BC57B3}>)
      2: SOLVE-WITH-CACHE returned (2070 45)
      2: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 0 0 1 #<HASH-TABLE :TEST EQL :COUNT 3 {1015BC57B3}>)
        3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 1 1 #<HASH-TABLE :TEST EQL :COUNT 3 {1015BC57B3}>)
        3: SOLVE-WITH-CACHE returned (0 45)
        3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 0 0 #<HASH-TABLE :TEST EQL :COUNT 3 {1015BC57B3}>)
        3: SOLVE-WITH-CACHE returned (0 0)
      2: SOLVE-WITH-CACHE returned (45 0)
    1: SOLVE-WITH-CACHE returned (45 2070)
  0: SOLVE-WITH-CACHE returned (4284990 2070)
#+end_example

By virtue of the search we are doing, we could go up the search space from
the bottom and then we would be guaranteed of having a cached value by only
keeping $N$ values in our cache.  That code, predictably, gets a bit more
involved.  Still easy to keep in one spot, though.  (And only keeping in
one spot as I am taking advantage of the trace outputs to do some
debugging.)

#+begin_src lisp :exports code
  (defun solve-with-lru-cache (sequence &optional (num-players 2) cur-player i j (cache (make-hash-table :size (* 2 (length sequence))) cache-supplied-p))
    (cond
      ;; Overall driver that moves us layer by layer
      ((not cache-supplied-p)

       ;; For keeping track of the recents, we will use a rudimentary ring buffer
       ;; Yes, I should have put this abstraction on top of the hashtable and been
       ;; cleaner.  I knew what my next iteration looked like, so didn't bother.
       (setf (gethash 'recents cache cache) (make-array (- (length sequence) 1))
             (gethash 'recents-head cache)  0
             (gethash 'recents-count cache) 0)
       (loop for inc from 1 below (length sequence)
             for cur-player = 0 then (setf cur-player (mod (1+ cur-player) num-players))
             do (loop for j from inc below (length sequence)
                      do (solve-with-lru-cache sequence num-players cur-player (- j inc) j cache)))
       (values (gethash (1- (length sequence)) cache)))

      ;;We had a cached value
      ((gethash (+ (* i (length sequence)) j) cache))

      ;;We are at the last choice, not bothering with cache here...
      ((= i j)
       (list 0 (elt sequence i)))

      ;;We have to compare left and right.
      (t
       (let* ((left-number            (elt sequence i))
              (right-number           (elt sequence j))
              (next-player            (mod (1+ cur-player) num-players))
              (left-opponent-choices  (copy-seq (solve-with-lru-cache sequence num-players next-player (1+ i) j cache)))
              (right-opponent-choices (copy-seq (solve-with-lru-cache sequence num-players next-player i (1- j) cache))))
         ;;And this is where my hamfisted eviction for the cache comes in.
         (let* ((recents       (gethash 'recents cache))
                (recents-head  (gethash 'recents-head cache))
                (recents-count (incf (gethash 'recents-count cache)))
                (recents-tail  (mod (1+ recents-head) (length recents))))
           (unless (< recents-count (length recents))
             (remhash (elt recents recents-tail) cache))

           (setf (elt recents recents-tail)    (+ (* i (length sequence)) j)
                 (gethash 'recents-head cache) recents-tail))

         (setf (gethash (+ (* i (length sequence)) j) cache)
               (if (> (incf (elt left-opponent-choices cur-player) left-number)
                      (incf (elt right-opponent-choices cur-player) right-number))
                   left-opponent-choices
                   right-opponent-choices))))))
#+end_src

#+RESULTS:
: SOLVE-WITH-LRU-CACHE

And how do I know that this uses the cache well?  The trace should show
that we never get further than 2 calls in.  (I'm not showing a gigantic
trace here, but the same pattern holds for that.  This trace is arguably
already gigantic...)

#+begin_src lisp :results verbatim output :exports both
  (trace solve-with-lru-cache)
  (let ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
    (solve-with-lru-cache (gen-sequence 4)))
  (untrace solve-with-lru-cache)
#+end_src

#+RESULTS:
#+begin_example
  0: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945))
    1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 0 1 #<HASH-TABLE :TEST EQL :COUNT 3 {1098AB56F3}>)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 1 1 #<HASH-TABLE :TEST EQL :COUNT 3 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (0 45)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 0 0 #<HASH-TABLE :TEST EQL :COUNT 3 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (0 0)
    1: SOLVE-WITH-LRU-CACHE returned (45 0)
    1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 1 2 #<HASH-TABLE :TEST EQL :COUNT 4 {1098AB56F3}>)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 2 2 #<HASH-TABLE :TEST EQL :COUNT 4 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (0 2070)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 1 1 #<HASH-TABLE :TEST EQL :COUNT 4 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (0 45)
    1: SOLVE-WITH-LRU-CACHE returned (2070 45)
    1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 2 3 #<HASH-TABLE :TEST EQL :COUNT 5 {1098AB56F3}>)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 3 3 #<HASH-TABLE :TEST EQL :COUNT 5 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (0 4284945)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 2 2 #<HASH-TABLE :TEST EQL :COUNT 5 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (0 2070)
    1: SOLVE-WITH-LRU-CACHE returned (4284945 2070)
    1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 0 2 #<HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}>)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 1 2 #<HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (2070 45)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 0 1 #<HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (45 0)
    1: SOLVE-WITH-LRU-CACHE returned (45 2070)
    1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 1 3 #<HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}>)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 2 3 #<HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (4284945 2070)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 1 2 #<HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (2070 45)
    1: SOLVE-WITH-LRU-CACHE returned (2070 4284990)
    1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 0 3 #<HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}>)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 1 3 #<HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (2070 4284990)
      2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 0 2 #<HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}>)
      2: SOLVE-WITH-LRU-CACHE returned (45 2070)
    1: SOLVE-WITH-LRU-CACHE returned (4284990 2070)
  0: SOLVE-WITH-LRU-CACHE returned (4284990 2070)
#+end_example

But, how does that do with the same test that I was unhappy with for the
unbounded cache?

#+begin_src lisp :results verbatim output :exports both
  (let ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
    (time
     (format t "We did get an answer, at least: ~a~&"
             (solve-with-lru-cache (gen-sequence (expt 10 4))))))
#+end_src

#+RESULTS:
: We did get an answer, at least: (2495838522951 2465448746904)
: Evaluation took:
:   14.264 seconds of real time
:   14.261510 seconds of total run time (14.082674 user, 0.178836 system)
:   [ Run times consist of 0.056 seconds GC time, and 14.206 seconds non-GC time. ]
:   99.99% CPU
:   54,093,054,074 processor cycles
:   3,201,016,448 bytes consed
:

As expected, is about the same in the speed, but much nicer to our memory.
It is especially obvious if I watch the memory usage of the machine.  And
somewhat clear from the lack of time spent in GC here.  (I will note that
this points out that I don't understand the "bytes consed" number.  Ah
well..)

