euler-477.html

<div id="outline-container-org2cc3f74" class="outline-2">
<h2 id="org2cc3f74">Restrict the size of the cache?</h2>
<div class="outline-text-2" id="text-org2cc3f74">
<p>
This is somewhat silly, as the cache should be able to just keep a "layer"
of the solution in memory at any given time.  I could constrict it so that
it only has the last \(N\) values looked at in the cache.  That will help
with memory, but will not have much help for speed, I don't think.  Lets
find out.
</p>

<p>
Biggest callout here, is if we want to limit ourselves to \(N\) entries in the
cache, we have to change the order that we traverse the possibles.  In
particular, it is easy to see that we just go up and down a single "side"
of the search space here, and we wind up with a cache that is effectively
the entire search tree.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(trace solve-with-cache)
(<span style="color: #b6a0ff;">let</span> ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
  (solve-with-cache (gen-sequence 4)))
(untrace solve-with-cache)
</pre>
</div>

<pre class="example" id="org16ce51c">
0: (SOLVE-WITH-CACHE #(0 45 2070 4284945))
  1: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 1 3 #&lt;HASH-TABLE :TEST EQL :COUNT 0 {1015BC57B3}&gt;)
    2: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 0 2 3 #&lt;HASH-TABLE :TEST EQL :COUNT 0 {1015BC57B3}&gt;)
      3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 3 3 #&lt;HASH-TABLE :TEST EQL :COUNT 0 {1015BC57B3}&gt;)
      3: SOLVE-WITH-CACHE returned (0 4284945)
      3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 2 2 #&lt;HASH-TABLE :TEST EQL :COUNT 0 {1015BC57B3}&gt;)
      3: SOLVE-WITH-CACHE returned (0 2070)
    2: SOLVE-WITH-CACHE returned (4284945 2070)
    2: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 0 1 2 #&lt;HASH-TABLE :TEST EQL :COUNT 1 {1015BC57B3}&gt;)
      3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 2 2 #&lt;HASH-TABLE :TEST EQL :COUNT 1 {1015BC57B3}&gt;)
      3: SOLVE-WITH-CACHE returned (0 2070)
      3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 1 1 #&lt;HASH-TABLE :TEST EQL :COUNT 1 {1015BC57B3}&gt;)
      3: SOLVE-WITH-CACHE returned (0 45)
    2: SOLVE-WITH-CACHE returned (2070 45)
  1: SOLVE-WITH-CACHE returned (2070 4284990)
  1: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 0 2 #&lt;HASH-TABLE :TEST EQL :COUNT 3 {1015BC57B3}&gt;)
    2: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 0 1 2 #&lt;HASH-TABLE :TEST EQL :COUNT 3 {1015BC57B3}&gt;)
    2: SOLVE-WITH-CACHE returned (2070 45)
    2: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 0 0 1 #&lt;HASH-TABLE :TEST EQL :COUNT 3 {1015BC57B3}&gt;)
      3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 1 1 #&lt;HASH-TABLE :TEST EQL :COUNT 3 {1015BC57B3}&gt;)
      3: SOLVE-WITH-CACHE returned (0 45)
      3: (SOLVE-WITH-CACHE #(0 45 2070 4284945) 2 1 0 0 #&lt;HASH-TABLE :TEST EQL :COUNT 3 {1015BC57B3}&gt;)
      3: SOLVE-WITH-CACHE returned (0 0)
    2: SOLVE-WITH-CACHE returned (45 0)
  1: SOLVE-WITH-CACHE returned (45 2070)
0: SOLVE-WITH-CACHE returned (4284990 2070)
</pre>

<p>
By virtue of the search we are doing, we could go up the search space from
the bottom and then we would be guaranteed of having a cached value by only
keeping \(N\) values in our cache.  That code, predictably, gets a bit more
involved.  Still easy to keep in one spot, though.  (And only keeping in
one spot as I am taking advantage of the trace outputs to do some
debugging.)
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">solve-with-lru-cache</span> (sequence <span style="color: #6ae4b9;">&amp;optional</span> (num-players 2) cur-player i j (cache (make-hash-table <span style="color: #f78fe7;">:size</span> (* 2 (length sequence))) cache-supplied-p))
  (<span style="color: #b6a0ff;">cond</span>
    <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Overall driver that moves us layer by layer</span>
    ((not cache-supplied-p)

     <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">For keeping track of the recents, we will use a rudimentary ring buffer</span>
     <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Yes, I should have put this abstraction on top of the hashtable and been</span>
     <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">cleaner.  I knew what my next iteration looked like, so didn't bother.</span>
     (setf (gethash 'recents cache cache) (make-array (- (length sequence) 1))
           (gethash 'recents-head cache)  0
           (gethash 'recents-count cache) 0)
     (<span style="color: #b6a0ff;">loop</span> for inc from 1 below (length sequence)
           for cur-player = 0 then (setf cur-player (mod (1+ cur-player) num-players))
           do (<span style="color: #b6a0ff;">loop</span> for j from inc below (length sequence)
                    do (solve-with-lru-cache sequence num-players cur-player (- j inc) j cache)))
     (values (gethash (1- (length sequence)) cache)))

    <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">We had a cached value</span>
    ((gethash (+ (* i (length sequence)) j) cache))

    <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">We are at the last choice, not bothering with cache here...</span>
    ((= i j)
     (list 0 (elt sequence i)))

    <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">We have to compare left and right.</span>
    (t
     (<span style="color: #b6a0ff;">let*</span> ((left-number            (elt sequence i))
            (right-number           (elt sequence j))
            (next-player            (mod (1+ cur-player) num-players))
            (left-opponent-choices  (copy-seq (solve-with-lru-cache sequence num-players next-player (1+ i) j cache)))
            (right-opponent-choices (copy-seq (solve-with-lru-cache sequence num-players next-player i (1- j) cache))))
       <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">And this is where my hamfisted eviction for the cache comes in.</span>
       (<span style="color: #b6a0ff;">let*</span> ((recents       (gethash 'recents cache))
              (recents-head  (gethash 'recents-head cache))
              (recents-count (incf (gethash 'recents-count cache)))
              (recents-tail  (mod (1+ recents-head) (length recents))))
         (<span style="color: #b6a0ff;">unless</span> (&lt; recents-count (length recents))
           (remhash (elt recents recents-tail) cache))

         (setf (elt recents recents-tail)    (+ (* i (length sequence)) j)
               (gethash 'recents-head cache) recents-tail))

       (setf (gethash (+ (* i (length sequence)) j) cache)
             (<span style="color: #b6a0ff;">if</span> (&gt; (incf (elt left-opponent-choices cur-player) left-number)
                    (incf (elt right-opponent-choices cur-player) right-number))
                 left-opponent-choices
                 right-opponent-choices))))))
</pre>
</div>

<p>
And how do I know that this uses the cache well?  The trace should show
that we never get further than 2 calls in.  (I'm not showing a gigantic
trace here, but the same pattern holds for that.  This trace is arguably
already gigantic&#x2026;)
</p>

<div class="org-src-container">
<pre class="src src-lisp">(trace solve-with-lru-cache)
(<span style="color: #b6a0ff;">let</span> ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
  (solve-with-lru-cache (gen-sequence 4)))
(untrace solve-with-lru-cache)
</pre>
</div>

<pre class="example" id="orga3a6c10">
0: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945))
  1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 0 1 #&lt;HASH-TABLE :TEST EQL :COUNT 3 {1098AB56F3}&gt;)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 1 1 #&lt;HASH-TABLE :TEST EQL :COUNT 3 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (0 45)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 0 0 #&lt;HASH-TABLE :TEST EQL :COUNT 3 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (0 0)
  1: SOLVE-WITH-LRU-CACHE returned (45 0)
  1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 1 2 #&lt;HASH-TABLE :TEST EQL :COUNT 4 {1098AB56F3}&gt;)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 2 2 #&lt;HASH-TABLE :TEST EQL :COUNT 4 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (0 2070)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 1 1 #&lt;HASH-TABLE :TEST EQL :COUNT 4 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (0 45)
  1: SOLVE-WITH-LRU-CACHE returned (2070 45)
  1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 2 3 #&lt;HASH-TABLE :TEST EQL :COUNT 5 {1098AB56F3}&gt;)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 3 3 #&lt;HASH-TABLE :TEST EQL :COUNT 5 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (0 4284945)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 2 2 #&lt;HASH-TABLE :TEST EQL :COUNT 5 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (0 2070)
  1: SOLVE-WITH-LRU-CACHE returned (4284945 2070)
  1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 0 2 #&lt;HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}&gt;)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 1 2 #&lt;HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (2070 45)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 0 1 #&lt;HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (45 0)
  1: SOLVE-WITH-LRU-CACHE returned (45 2070)
  1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 1 3 #&lt;HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}&gt;)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 2 3 #&lt;HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (4284945 2070)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 1 2 #&lt;HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (2070 45)
  1: SOLVE-WITH-LRU-CACHE returned (2070 4284990)
  1: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 0 0 3 #&lt;HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}&gt;)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 1 3 #&lt;HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (2070 4284990)
    2: (SOLVE-WITH-LRU-CACHE #(0 45 2070 4284945) 2 1 0 2 #&lt;HASH-TABLE :TEST EQL :COUNT 6 {1098AB56F3}&gt;)
    2: SOLVE-WITH-LRU-CACHE returned (45 2070)
  1: SOLVE-WITH-LRU-CACHE returned (4284990 2070)
0: SOLVE-WITH-LRU-CACHE returned (4284990 2070)
</pre>

<p>
But, how does that do with the same test that I was unhappy with for the
unbounded cache?
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #b6a0ff;">let</span> ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
  (time
   (format t <span style="color: #79a8ff;">"We did get an answer, at least: ~a~&amp;"</span>
           (solve-with-lru-cache (gen-sequence (expt 10 4))))))
</pre>
</div>

<pre class="example">
We did get an answer, at least: (2495838522951 2465448746904)
Evaluation took:
  14.264 seconds of real time
  14.261510 seconds of total run time (14.082674 user, 0.178836 system)
  [ Run times consist of 0.056 seconds GC time, and 14.206 seconds non-GC time. ]
  99.99% CPU
  54,093,054,074 processor cycles
  3,201,016,448 bytes consed

</pre>


<p>
As expected, is about the same in the speed, but much nicer to our memory.
It is especially obvious if I watch the memory usage of the machine.  And
somewhat clear from the lack of time spent in GC here.  (I will note that
this points out that I don't understand the "bytes consed" number.  Ah
well..)
</p>
</div>
</div>
