euler-477.org
* Not going to wait for that to complete.

Sadly, that paints a pretty clear picture that this will not help get the
answer for $10^8$.  And it is fairly clear why.  This is calculating every
node in the search space.  And, that space has $N(N + 1) \over 2$ values in
it.  By the time we get to $10^8$ for $N$, this is clearly slogging us
down.

To put some probably wrong numbers to it, we see that it takes 14 seconds
to calculate for $10^4$ values.  That puts this at about 40 some odd years
using this code.

Just for the laughs to sanity check that math, lets predict how long it
would take to solve a 4000 length sequence and then try it.

#+begin_src lisp :results verbatim output :exports both
  (defun triangle-number (n)
    (/ (* n (+ n 1))
       2))
  (format t "We are predicting ~F seconds.~&" (* (triangle-number 4000) (/ 14 (triangle-number (expt 10 4)))))
  (let ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
    (time
     (format t "Our answer was: ~a~&"
             (solve-with-lru-cache (gen-sequence 4000)))))
#+end_src

#+RESULTS:
#+begin_example
We are predicting 2.240336 seconds.
Our answer was: (1006836930817 969259845004)
Evaluation took:
  2.272 seconds of real time
  2.271653 seconds of total run time (2.271653 user, 0.000000 system)
  [ Run times consist of 0.003 seconds GC time, and 2.269 seconds non-GC time. ]
  100.00% CPU
  8,615,589,102 processor cycles
  512,378,512 bytes consed

#+end_example

That prediction comes out fairly close, all told.

* Could I just be more efficient per layer?

Certainly.  The above was my hamfisting an eviction policy into the cache,
but we could save a multiplication and hash (and an amusing amount of code)
by building up the score on the way up the space.  That could look roughly
like:

#+begin_src lisp :exports code
  (defun solve-by-layer (sequence &optional (num-players 2) cur-player i j (cache (make-array (length sequence)) cache-supplied-p))
    (cond
      ;; Overall driver that moves us layer by layer
      ((not cache-supplied-p)
       ;;Have to seed the base score
       (loop for i from 0 below (length sequence)
             do (setf (elt cache i) (list 0 (elt sequence i))))
       ;;Then, mostly proceed as before
       (loop for inc from 1 below (length sequence)
             for cur-player = 0 then (setf cur-player (mod (1+ cur-player) num-players))
             do (loop for j from inc below (length sequence)
                      do (solve-by-layer sequence num-players cur-player (- j inc) j cache)))
       (elt cache 0))

      ;;We have to compare left and right.
      (t
       (let* ((left-number            (elt sequence i))
              (right-number           (elt sequence j))
              (left-opponent-choices  (copy-seq (elt cache (1+ i))))
              (right-opponent-choices (copy-seq (elt cache i))))

         (setf (elt cache i)
               (if (> (incf (elt left-opponent-choices cur-player) left-number)
                      (incf (elt right-opponent-choices cur-player) right-number))
                   left-opponent-choices
                   right-opponent-choices))))))
#+end_src

#+RESULTS:
: SOLVE-BY-LAYER

As desired, this never drops below a single recursive call.

#+begin_src lisp :results verbatim output :exports both
  (trace solve-by-layer)
  (let ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
    (solve-by-layer (gen-sequence 4)))
  (untrace solve-by-layer)
#+end_src

#+RESULTS:
#+begin_example
  0: (SOLVE-BY-LAYER #(0 45 2070 4284945))
    1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 0 0 1 #((0 0) (0 45) (0 2070) (0 4284945)))
    1: SOLVE-BY-LAYER returned (45 0)
    1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 0 1 2 #((45 0) (0 45) (0 2070) (0 4284945)))
    1: SOLVE-BY-LAYER returned (2070 45)
    1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 0 2 3 #((45 0) (2070 45) (0 2070) (0 4284945)))
    1: SOLVE-BY-LAYER returned (4284945 2070)
    1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 1 0 2 #((45 0) (2070 45) (4284945 2070) (0 4284945)))
    1: SOLVE-BY-LAYER returned (45 2070)
    1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 1 1 3 #((45 2070) (2070 45) (4284945 2070) (0 4284945)))
    1: SOLVE-BY-LAYER returned (2070 4284990)
    1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 0 0 3 #((45 2070) (2070 4284990) (4284945 2070) (0 4284945)))
    1: SOLVE-BY-LAYER returned (4284990 2070)
  0: SOLVE-BY-LAYER returned (4284990 2070)
#+end_example

For speed, this is unsurprisingly better.

#+begin_src lisp :results verbatim output :exports both
  (let ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
    (time
     (format t "We did get an answer, at least: ~a~&"
             (solve-by-layer (gen-sequence (expt 10 4))))))
#+end_src

#+RESULTS:
: We did get an answer, at least: (2495838522951 2465448746904)
: Evaluation took:
:   3.500 seconds of real time
:   3.502130 seconds of total run time (3.502111 user, 0.000019 system)
:   [ Run times consist of 0.040 seconds GC time, and 3.463 seconds non-GC time. ]
:   100.06% CPU
:   13,279,585,526 processor cycles
:   3,200,161,024 bytes consed
:

Still has me in years of processing time.  :(

* Could I go parallel?

I don't see why not?  Just using threads on my computer is unlikely to
really help too much, as I don't have that many cores.  I do, however, have
a GPU I could try with.  Same napkin math has it such that that should
complete in a few weeks.  Which, yes, is faster than years.  Still feels
sadly misguided.

* Could I get even more efficient per layer?

Almost certainly.  Drop all of the copies I'm doing above and things should
get better.  Probably not by enough to matter, annoyingly.  My specific
target has to drop this by a factor of about a million?  I don't want a
solution that takes more than a minute or so.

I could also port this to a different runtime.  That would require some
changes, of course, but the general idea would stay the same.  May give
this a try.

* Any obvious non $N^2$ algorithms for this?

Not surprisingly, I spent more time writing up the above than I did
thinking about or doing any of that.  As stated, I wanted a solution that
could go in less than a minute.  Assuming I was correct in the number of
decisions, that general direction has a silly floor of months if I shrank
it down to a few cycles per decision.  Which, is clearly not happening.

Unfortunately, I mostly thought of dead ends to solve it.  The size of the
decision space was enough that all of the potentially fun ways to implement
a solution I thought of were not really options.

In particular, I was really hoping I'd see a clever way of using a BDD/ZDD.
This would be my second use of those.  If there is an easy formulation for
that, I'm not seeing it.  And since I blew the memory on the basic
hashtable of all of the solutions, and a BDD node is bigger than a score, I
haven't even bothered to really do the math of how big the BDD could be.

