euler-477.html

<div id="outline-container-org4b932d0" class="outline-2">
<h2 id="org4b932d0">Not going to wait for that to complete.</h2>
<div class="outline-text-2" id="text-org4b932d0">
<p>
Sadly, that paints a pretty clear picture that this will not help get the
answer for \(10^8\).  And it is fairly clear why.  This is calculating every
node in the search space.  And, that space has \(N(N + 1) \over 2\) values in
it.  By the time we get to \(10^8\) for \(N\), this is clearly slogging us
down.
</p>

<p>
To put some probably wrong numbers to it, we see that it takes 14 seconds
to calculate for \(10^4\) values.  That puts this at about 40 some odd years
using this code.
</p>

<p>
Just for the laughs to sanity check that math, lets predict how long it
would take to solve a 4000 length sequence and then try it.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">triangle-number</span> (n)
  (/ (* n (+ n 1))
     2))
(format t <span style="color: #79a8ff;">"We are predicting ~F seconds.~&amp;"</span> (* (triangle-number 4000) (/ 14 (triangle-number (expt 10 4)))))
(<span style="color: #b6a0ff;">let</span> ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
  (time
   (format t <span style="color: #79a8ff;">"Our answer was: ~a~&amp;"</span>
           (solve-with-lru-cache (gen-sequence 4000)))))
</pre>
</div>

<pre class="example" id="org22dd35c">
We are predicting 2.240336 seconds.
Our answer was: (1006836930817 969259845004)
Evaluation took:
  2.272 seconds of real time
  2.271653 seconds of total run time (2.271653 user, 0.000000 system)
  [ Run times consist of 0.003 seconds GC time, and 2.269 seconds non-GC time. ]
  100.00% CPU
  8,615,589,102 processor cycles
  512,378,512 bytes consed

</pre>

<p>
That prediction comes out fairly close, all told.
</p>
</div>
</div>

<div id="outline-container-orgb2f57cf" class="outline-2">
<h2 id="orgb2f57cf">Could I just be more efficient per layer?</h2>
<div class="outline-text-2" id="text-orgb2f57cf">
<p>
Certainly.  The above was my hamfisting an eviction policy into the cache,
but we could save a multiplication and hash (and an amusing amount of code)
by building up the score on the way up the space.  That could look roughly
like:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">solve-by-layer</span> (sequence <span style="color: #6ae4b9;">&amp;optional</span> (num-players 2) cur-player i j (cache (make-array (length sequence)) cache-supplied-p))
  (<span style="color: #b6a0ff;">cond</span>
    <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Overall driver that moves us layer by layer</span>
    ((not cache-supplied-p)
     <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">Have to seed the base score</span>
     (<span style="color: #b6a0ff;">loop</span> for i from 0 below (length sequence)
           do (setf (elt cache i) (list 0 (elt sequence i))))
     <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">Then, mostly proceed as before</span>
     (<span style="color: #b6a0ff;">loop</span> for inc from 1 below (length sequence)
           for cur-player = 0 then (setf cur-player (mod (1+ cur-player) num-players))
           do (<span style="color: #b6a0ff;">loop</span> for j from inc below (length sequence)
                    do (solve-by-layer sequence num-players cur-player (- j inc) j cache)))
     (elt cache 0))

    <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">We have to compare left and right.</span>
    (t
     (<span style="color: #b6a0ff;">let*</span> ((left-number            (elt sequence i))
            (right-number           (elt sequence j))
            (left-opponent-choices  (copy-seq (elt cache (1+ i))))
            (right-opponent-choices (copy-seq (elt cache i))))

       (setf (elt cache i)
             (<span style="color: #b6a0ff;">if</span> (&gt; (incf (elt left-opponent-choices cur-player) left-number)
                    (incf (elt right-opponent-choices cur-player) right-number))
                 left-opponent-choices
                 right-opponent-choices))))))
</pre>
</div>

<p>
As desired, this never drops below a single recursive call.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(trace solve-by-layer)
(<span style="color: #b6a0ff;">let</span> ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
  (solve-by-layer (gen-sequence 4)))
(untrace solve-by-layer)
</pre>
</div>

<pre class="example" id="org331a1f1">
0: (SOLVE-BY-LAYER #(0 45 2070 4284945))
  1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 0 0 1 #((0 0) (0 45) (0 2070) (0 4284945)))
  1: SOLVE-BY-LAYER returned (45 0)
  1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 0 1 2 #((45 0) (0 45) (0 2070) (0 4284945)))
  1: SOLVE-BY-LAYER returned (2070 45)
  1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 0 2 3 #((45 0) (2070 45) (0 2070) (0 4284945)))
  1: SOLVE-BY-LAYER returned (4284945 2070)
  1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 1 0 2 #((45 0) (2070 45) (4284945 2070) (0 4284945)))
  1: SOLVE-BY-LAYER returned (45 2070)
  1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 1 1 3 #((45 2070) (2070 45) (4284945 2070) (0 4284945)))
  1: SOLVE-BY-LAYER returned (2070 4284990)
  1: (SOLVE-BY-LAYER #(0 45 2070 4284945) 2 0 0 3 #((45 2070) (2070 4284990) (4284945 2070) (0 4284945)))
  1: SOLVE-BY-LAYER returned (4284990 2070)
0: SOLVE-BY-LAYER returned (4284990 2070)
</pre>

<p>
For speed, this is unsurprisingly better.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #b6a0ff;">let</span> ((*TRACE-OUTPUT* *STANDARD-OUTPUT*))
  (time
   (format t <span style="color: #79a8ff;">"We did get an answer, at least: ~a~&amp;"</span>
           (solve-by-layer (gen-sequence (expt 10 4))))))
</pre>
</div>

<pre class="example">
We did get an answer, at least: (2495838522951 2465448746904)
Evaluation took:
  3.500 seconds of real time
  3.502130 seconds of total run time (3.502111 user, 0.000019 system)
  [ Run times consist of 0.040 seconds GC time, and 3.463 seconds non-GC time. ]
  100.06% CPU
  13,279,585,526 processor cycles
  3,200,161,024 bytes consed

</pre>


<p>
Still has me in years of processing time.  :(
</p>
</div>
</div>

<div id="outline-container-org36a3dd8" class="outline-2">
<h2 id="org36a3dd8">Could I go parallel?</h2>
<div class="outline-text-2" id="text-org36a3dd8">
<p>
I don't see why not?  Just using threads on my computer is unlikely to
really help too much, as I don't have that many cores.  I do, however, have
a GPU I could try with.  Same napkin math has it such that that should
complete in a few weeks.  Which, yes, is faster than years.  Still feels
sadly misguided.
</p>
</div>
</div>

<div id="outline-container-org5a64695" class="outline-2">
<h2 id="org5a64695">Could I get even more efficient per layer?</h2>
<div class="outline-text-2" id="text-org5a64695">
<p>
Almost certainly.  Drop all of the copies I'm doing above and things should
get better.  Probably not by enough to matter, annoyingly.  My specific
target has to drop this by a factor of about a million?  I don't want a
solution that takes more than a minute or so.
</p>

<p>
I could also port this to a different runtime.  That would require some
changes, of course, but the general idea would stay the same.  May give
this a try.
</p>
</div>
</div>

<div id="outline-container-org54339db" class="outline-2">
<h2 id="org54339db">Any obvious non \(N^2\) algorithms for this?</h2>
<div class="outline-text-2" id="text-org54339db">
<p>
Not surprisingly, I spent more time writing up the above than I did
thinking about or doing any of that.  As stated, I wanted a solution that
could go in less than a minute.  Assuming I was correct in the number of
decisions, that general direction has a silly floor of months if I shrank
it down to a few cycles per decision.  Which, is clearly not happening.
</p>

<p>
Unfortunately, I mostly thought of dead ends to solve it.  The size of the
decision space was enough that all of the potentially fun ways to implement
a solution I thought of were not really options.
</p>

<p>
In particular, I was really hoping I'd see a clever way of using a BDD/ZDD.
This would be my second use of those.  If there is an easy formulation for
that, I'm not seeing it.  And since I blew the memory on the basic
hashtable of all of the solutions, and a BDD node is bigger than a score, I
haven't even bothered to really do the math of how big the BDD could be.
</p>
</div>
</div>
