euler-477.org
* How about linear?

Basically, I felt there had to be a linear solution to this.  Largely as I
don't imagine folks are leaving machines running for a long time to get
some puzzle answers.  I appreciate that I can be wrong there.

At any rate, if this is the case, I want a solution that is light on the
backtracking.  Preferrably with none.  After staring at many solutions I
didn't come up with much.  About the best I can see is that player 1 has a
clear "floor" on what their high score is.  Specifically, the max of either
all odd indexed values, or all even indexed.  Annoyingly, this gives the
"answer" for the first few values.  Is wrong starting at $10^4$, though.

#+begin_src lisp :exports both
  (let ((counts (list 2 4 100 (expt 10 4))))
    (loop for n in counts
          collect (loop with s = (gen-sequence n)
                        for v across s
                        for i from 1
                        if (= 0 (mod i 2))
                          sum v into even-sum
                        else
                          sum v into odd-sum
                        finally (return (list (max even-sum odd-sum) (min even-sum odd-sum))))))
#+end_src

#+RESULTS:
|            45 |             0 |
|       4284990 |          2070 |
|   26365463243 |   24078282389 |
| 2487583914490 | 2473703355365 |

My original hope was that I could concoct an algorithm where player 1 looks
to steal a number along the way, with a preference to whichever set of
numbers has the highest sum remaining.  I couldn't come up with one that
helps for player 2, though.  Their goal is to try to keep the numbers such
that player 1 doesn't want to steal?  I couldn't find it.

Other ideas involved trying to look at all of the increasing "runs" in the
number sequence.  The idea being that, along a run of decreasing values,
the strategy is to just pull from one direction.

To demonstrate, lets get something that shows us the "path."

#+begin_src lisp :exports code
  (defun solve-showing-work (sequence &optional (num-players 2) cur-player i j (cache (make-array (length sequence)) cache-supplied-p))
    (cond
      ;; Overall driver that moves us layer by layer
      ((not cache-supplied-p)
       ;;Have to seed the base score
       (loop for i from 0 below (length sequence)
             do (setf (elt cache i) (list 0 (elt sequence i)(list (list 'no-choice (elt sequence i))))))
       ;;Then, mostly proceed as before
       (loop for inc from 1 below (length sequence)
             for cur-player = 0 then (setf cur-player (mod (1+ cur-player) num-players))
             do (loop for j from inc below (length sequence)
                      do (solve-showing-work sequence num-players cur-player (- j inc) j cache)))
       (elt cache 0))

      ;;We have to compare left and right.
      (t
       (let* ((left-number            (elt sequence i))
              (right-number           (elt sequence j))
              (left-opponent-choices  (copy-seq (elt cache (1+ i))))
              (right-opponent-choices (copy-seq (elt cache i))))

         (push (list 'left left-number) (elt left-opponent-choices 2))
         (push (list 'right right-number) (elt right-opponent-choices 2))

         (setf (elt cache i)
               (if (> (incf (elt left-opponent-choices cur-player) left-number)
                      (incf (elt right-opponent-choices cur-player) right-number))
                   left-opponent-choices
                   right-opponent-choices))))))
#+end_src

#+RESULTS:
: SOLVE-SHOWING-WORK

With that, a few examples.  First, one that shows a "run" of numbers is
followed.

#+begin_src lisp :exports both
  (solve-showing-work #(8 7 6 5 4 3 2 1))
#+end_src

#+RESULTS:
| 20 | 16 | ((LEFT 8) (LEFT 7) (LEFT 6) (LEFT 5) (LEFT 4) (LEFT 3) (LEFT 2) (NO-CHOICE 1)) |

Of course, it isn't hard to see how to force alternating left/right
choices.

#+begin_src lisp :exports both
  (solve-showing-work #(7 5 3 1 2 4 6 8))
#+end_src

#+RESULTS:
| 20 | 16 | ((RIGHT 8) (LEFT 7) (RIGHT 6) (LEFT 5) (RIGHT 4) (LEFT 3) (RIGHT 2) (NO-CHOICE 1)) |

And I can't immediately see why this starts from the right before jumping
to the left.

#+begin_src lisp :exports both
  (solve-showing-work #(10 11 12 13 7 5 3 1 2 4 6 8))
#+end_src

#+RESULTS:
| 43 | 39 | ((RIGHT 8) (RIGHT 6) (RIGHT 4) (LEFT 10) (LEFT 11) (LEFT 12) (LEFT 13) (LEFT 7) (LEFT 5) (LEFT 3) (RIGHT 2) (NO-CHOICE 1)) |
