euler-477.html

<div id="outline-container-org7426634" class="outline-2">
<h2 id="org7426634">How about linear?</h2>
<div class="outline-text-2" id="text-org7426634">
<p>
Basically, I felt there had to be a linear solution to this.  Largely as I
don't imagine folks are leaving machines running for a long time to get
some puzzle answers.  I appreciate that I can be wrong there.
</p>

<p>
At any rate, if this is the case, I want a solution that is light on the
backtracking.  Preferrably with none.  After staring at many solutions I
didn't come up with much.  About the best I can see is that player 1 has a
clear "floor" on what their high score is.  Specifically, the max of either
all odd indexed values, or all even indexed.  Annoyingly, this gives the
"answer" for the first few values.  Is wrong starting at \(10^4\), though.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #b6a0ff;">let</span> ((counts (list 2 4 100 (expt 10 4))))
  (<span style="color: #b6a0ff;">loop</span> for n in counts
        collect (<span style="color: #b6a0ff;">loop</span> with s = (gen-sequence n)
                      for v across s
                      for i from 1
                      if (= 0 (mod i 2))
                        sum v into even-sum
                      else
                        sum v into odd-sum
                      finally (<span style="color: #b6a0ff;">return</span> (list (max even-sum odd-sum) (min even-sum odd-sum))))))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">45</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">4284990</td>
<td class="org-right">2070</td>
</tr>

<tr>
<td class="org-right">26365463243</td>
<td class="org-right">24078282389</td>
</tr>

<tr>
<td class="org-right">2487583914490</td>
<td class="org-right">2473703355365</td>
</tr>
</tbody>
</table>

<p>
My original hope was that I could concoct an algorithm where player 1 looks
to steal a number along the way, with a preference to whichever set of
numbers has the highest sum remaining.  I couldn't come up with one that
helps for player 2, though.  Their goal is to try to keep the numbers such
that player 1 doesn't want to steal?  I couldn't find it.
</p>

<p>
Other ideas involved trying to look at all of the increasing "runs" in the
number sequence.  The idea being that, along a run of decreasing values,
the strategy is to just pull from one direction.
</p>

<p>
To demonstrate, lets get something that shows us the "path."
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">solve-showing-work</span> (sequence <span style="color: #6ae4b9;">&amp;optional</span> (num-players 2) cur-player i j (cache (make-array (length sequence)) cache-supplied-p))
  (<span style="color: #b6a0ff;">cond</span>
    <span style="color: #a8a8a8; font-style: italic;">;; </span><span style="color: #a8a8a8; font-style: italic;">Overall driver that moves us layer by layer</span>
    ((not cache-supplied-p)
     <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">Have to seed the base score</span>
     (<span style="color: #b6a0ff;">loop</span> for i from 0 below (length sequence)
           do (setf (elt cache i) (list 0 (elt sequence i)(list (list 'no-choice (elt sequence i))))))
     <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">Then, mostly proceed as before</span>
     (<span style="color: #b6a0ff;">loop</span> for inc from 1 below (length sequence)
           for cur-player = 0 then (setf cur-player (mod (1+ cur-player) num-players))
           do (<span style="color: #b6a0ff;">loop</span> for j from inc below (length sequence)
                    do (solve-showing-work sequence num-players cur-player (- j inc) j cache)))
     (elt cache 0))

    <span style="color: #a8a8a8; font-style: italic;">;;</span><span style="color: #a8a8a8; font-style: italic;">We have to compare left and right.</span>
    (t
     (<span style="color: #b6a0ff;">let*</span> ((left-number            (elt sequence i))
            (right-number           (elt sequence j))
            (left-opponent-choices  (copy-seq (elt cache (1+ i))))
            (right-opponent-choices (copy-seq (elt cache i))))

       (push (list 'left left-number) (elt left-opponent-choices 2))
       (push (list 'right right-number) (elt right-opponent-choices 2))

       (setf (elt cache i)
             (<span style="color: #b6a0ff;">if</span> (&gt; (incf (elt left-opponent-choices cur-player) left-number)
                    (incf (elt right-opponent-choices cur-player) right-number))
                 left-opponent-choices
                 right-opponent-choices))))))
</pre>
</div>

<p>
With that, a few examples.  First, one that shows a "run" of numbers is
followed.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(solve-showing-work #(8 7 6 5 4 3 2 1))
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">20</td>
<td class="org-right">16</td>
<td class="org-left">((LEFT 8) (LEFT 7) (LEFT 6) (LEFT 5) (LEFT 4) (LEFT 3) (LEFT 2) (NO-CHOICE 1))</td>
</tr>
</tbody>
</table>

<p>
Of course, it isn't hard to see how to force alternating left/right
choices.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(solve-showing-work #(7 5 3 1 2 4 6 8))
</pre>
</div>

<p>
And I can't immediately see why this starts from the right before jumping
to the left.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(solve-showing-work #(10 11 12 13 7 5 3 1 2 4 6 8))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Josh Berry</p>
<p class="date">Created: 2023-01-31 Tue 05:03</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>